Repository: RusackN1/Advance_Wesnoth_Wars
Catalog: translations/*/LC_MESSAGES/wesnoth-aww.po
Languages: fr

source: no random misses
fr: sans coups manqués

source: damage
fr: dégâts

source: strikes
fr: frappes

source: estimated
fr: estimé

source: estimated with
fr: estimé avec

source: HP
fr: PV

source: No Random Combats
fr: Combats Non-Aléatoires

source: Attacks will never randomly miss, hit rating is instead instead used as base damage reducer.
fr: Les attaques ne manqueront jamais au hasard, et la probabilité de rater est utilisée comme réducteur de dégâts de base.

source: Squad Mode
fr: Mode Escouade

source: Custom
fr: Personnalisé

source: The number of strikes of this attack decreases when the unit is wounded. The number of strikes is proportional to the percentage of its of maximum HP the unit has. For example a unit with 3/4 of its maximum HP will get 3/4 of the number of strikes.
fr: Le nombre de frappes de cette attaque diminue quand le porteur est blessé. Le nombre est proportionnel au pourcentage de points de vie que l'unité a.

source: Minimum will be 1.
fr: Le minimum sera 1.

source: Advanced Wesnoth Wars
fr: Advanced Wesnoth Wars (FR)

source: 1. No Random Combats
fr: 1. Combats Non-Aléatoires

source: 2. Increased Damage
fr: 2. Dégâts Augmentés

source: 3. Squad Mode
fr: 3. Mode Escouade

source: L-Up Notif
fr: N-Sup Notif

source: 4. L-Up Relative Heal
fr: 4. N-Sup Soin Relatif

source: 5. L-Up AMLA Bonuses
fr: 5. N-Sup Bonus AMLA

source: 6. L-Up AMLA Promoted Leaders
fr: 6. N-Sup Promus Leaders AMLA

source: 7. Gifted Heroes
fr: 7. Héros surentraînés/doués

source: 8. Passive XP
fr: 8. XP Passive

source: /turn]
fr: /tour]

source: 9. Healing XP
fr: 9. XP Soin

source: 10. Berserk tweak
fr: 10. Mod Berserk

source: 11. Ambushed tweak
fr: 11. Mod Embuscade

source: 12. NINJA WARS!
fr: 12. GUERRES NINJA!

source: Verbose
fr: Verbosité

source: Enabled :
fr: Activé :

source: All options are disabled.
fr: Toutes les options sont désactivées.

source: regenerates
fr: régénération

source: female^regenerates
fr: régénération

source: The unit will heal itself
fr: L'unité peut se soigner

source: HP per turn. Poison will be
fr: PV par tour. Le poison sera

source: instead of healing.
fr: à la place du soin.

source: camouflaged
fr: camouflé

source: female^camouflaged
fr: camouflée

source: This unit remains undetected by its enemies in villages, forests, deep water, or everywhere at night, except by those standing next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
fr: L'unité reste indétectée par ses ennemis dans les villages, forêts, eau profonde, et partout durant la nuit, excepté par ceux adajcents. Le premier ennemi qui découvre cette unité perd immédiatement ses déplacements restants.

source: squad
fr: escouade

source: distract
fr: distraction

source: female^distract
fr: distraction

source: This unit negates enemy Zones of Control around itself for allied units (but not for itself).
fr: L'unité annule la Zone de Control autour d'elle pour les unités alliés (mais pas pour elle-même)

source: fury
fr: fureur

source: female^fury
fr: fureur

source: When used offensively : - This attack deals more damage to the target. - It also causes this unit to take more damage from the target’s counterattack. - The damage ratio starts at 1.5, increases of 0.5 after each attack, until 2.5, then drop to 1, and continue the cycle. - If the attack kill, the attack gains a permanent 1 extra damage per strike (max: 15) - If the attack kill, the unit gain 1 extra attack and 1 extra move.
fr: Lorsqu'utilisé en offensive : - Cette attaque inflige + de dégâts à la cible. - L'unité recevra en contrepartie des dégâts supplémentaires de contre-attaques. - Les dégâts commencent avec un ratio de 1,5, augmentent de 0,5 après chaque attaque, jusqu'à 2,5, ensuit repasse à 1 puis le cycle continue - si l'attaque tue, l'attaque gagne 1 dégât supplémentaire permanent par frappe (max: 15) - Si l'attaque tue, l'unité gagne 1 attaque supplémentaire et 1 déplacement supplémentaire..

source: bloodthirsty
fr: soif de sang

source: female^bloodthirsty
fr: soif de sang

source: (Only available offensively)
fr: (Seulement accessible offensivement)

source: This unit drains health from living units, healing itself for half the amount of damage it deals (rounded down).
fr: L'unité draine la vie des unités vivantes et se régénère de la moitié des dégâts causés (arrondis à l'inférieur).

source: When used offensively, this special effect presses the assault engagement for 1-4 rounds, or until one of the combattants is slain ; after that the weapon damage will be increased by 1 permanently (until max +15). The attack limit is based based on health ratio and a random factor, recalculated for each new assault.
fr: Uniquement disponible en offensive, cet effet spécial rallonge l'engagement pendant 1 à 4 rounds ou jusqu'à ce que l'un des combattants soit tué. Après cela, les dégâts de l'arme seront augmentés de 1 de façon permanente (jusqu'à max +15). La limite d'attaque est basée sur le ratio de santé et un facteur aléatoire, recalculé à chaque nouvelle attaque.

source: Chief
fr: Chef

source: gifted
fr: doué

source: female^gifted
fr: douée

source: <italic>text='Gifted'</italic> with great potential or trained by the bests, this person is unrivaled on a battlefield.
fr: <italic>text='Doué'</italic> d'un grand potentiel ou entraîné par les meilleurs, cette personne est sans rivaux sur un champ de bataille.

source: stealthy
fr: furtif

source: female^stealthy
fr: furtive

source: <italic>text='Stealthy'</italic> like a ninja. Can move very fast, hide almost everywhere, attack by surprise, pass discretely behind enemies lines.
fr: <italic>text='Furtif'</italic> comme un ninja. Peut se déplacer très vite, se cacher presque partout, attaquer par surprise, passer discrètement derrière les lignes ennemies.

source: recruit
fr: recrute

source: female^recruit
fr: recrute

source: <italic>text='Recruiter'</italic>, this unit was promoted and allowed recruit and recall units in the name of the leader.
fr: <italic>text='Recruiteur'</italic>, cette unité a été promue et a peut recruter ou rappeler des unités.

source: female^squad
fr: squad

source: <italic>text='Squad'</italic> unit, its HP represent the number of them able to fight. The less they are, the less they do strikes.
fr: <italic>text='Escouade'</italic> les PV de cette unité représentent leur nombre en capacité de se battre. Moins ils sont nombreux, moins ils frappent.

source: born-leader
fr: leader-né

source: female^born-leader
fr: leader-née

source: <italic>text='Born leader'</italic>, a natural one.
fr: <italic>text='Leader-né'</italic>, un naturel.

source: Promoted!
fr: Promu!

source: melee
fr: mêlée

source: ranged
fr: à distance

source: Moves
fr: Déplacements

source: Leadership
fr: Commandement

source: Firststrike
fr: Initiative

source: Gifted!
fr: Doué!

source: breath
fr: souffle

source: attacks left
fr: attaques restantes

source: Surprise Attack!
fr: Attaque surprise!

source: sighted
fr: repéré

source: ambushed!
fr: piégé!

source: Advancement
fr: Avancement

source: LEVEL UP
fr: NIVEAU SUP

source: Default:ON
fr: Par défaut: Activé

source: 2. No Random Combats : Adjusted Damage %
fr: 2. Combats Non-Aléatoires : Ajustement dégâts %

source: To increase/reduce terrain/fixed Hit probabilities, converted in damages. Only applies for 'No Random Combats'. Default: +10%
fr: Pour augmenter/réduire les bonus de probabilités de terrain / capacités. S'applique uniquement à 'Combats Non-aléatoires'. Par défaut: + 10%

source: 3. Squad Mode (HP-related strikes) :
fr: 3. Mode Escouade (Nombre de frappes lié aux PV)

source: Units lacking lot of HP do proportionally less attack strikes (or less damage for single-strike attacks). Swarm is a worse ratio (-1 strike if you miss just 1 HP), but native, so considered by AI. In both cases, minimum strikes will be 1, and will not apply for berserk. Default:
fr: Les unités n'ayant pas beaucoup de HP effectuent proportionnellement moins de frappes (ou moins de dégâts pour les attaques à une seule frappe). 'Swarm' est un calcul plus approximatif (-1 frappes si vous manquez 1 HP), mais natif, donc interprété par l'IA. Dans les deux cas, le nombre minimum de frappe sera de 1 et ne s'appliquera pas aux berserks. Par défaut:

source: No
fr: Non

source: Level-Up : Floating Notification
fr: Niveau Sup : Notification flottante

source: Floating text on the unit currently leveling-up. Can be helpful to know which unit is concerned by an advancement. Will display only if no other AWW mods wants to display something at this moment. Default:ON
fr: Texte flottant sur l'unité en cours d'évolution. Utile pour savoir quelle unité est concernée par un avancement. Ne s'affichera que si aucun autre mod AWW ne souhaite afficher quelque chose à ce moment. Par défaut: ON

source: 4. Level-Up : Relative Healing
fr: 4. Niveau Sup : Soin Relatif

source: When an unit advances a level raising his Max HP, instead of a full healing and being cured, it keep the missing HP, but statuses are cured. Default:ON
fr: Lorsqu'une unité progresse d'un niveau augmentant ses PV maximum, au lieu de guérir complètement et d'être soignée, elle conserve les PV manquants, mais les statuts sont guéris. Par défaut: ON

source: 5. Level-Up : Random Bonuses After Max Level Advancement
fr: 5. Niveau Sup : Bonus aléatoires Après Avancement Niveau Max

source: Units reaching AMLA level-ups can gain an a random ability or increased stat each level. Default:ON
fr: Les unités qui augmentent leurs niveaux AMLA peuvent acquérir une capacité aléatoire ou augmenter leurs statistiques à chaque niveau. Par défaut: ON

source: 6. Level-Up : Promoted Leaders After Max Level Advancement
fr: 6. Niveau Sup : Promus Leaders Après Avancement Niveau Max

source: WARNING : Not Recommended for Campaigns, it can create bugs (like loose of unit or different recruit list).
fr: ATTENTION : Non-recommandé pour les Campagnes, peut déclencher des bugs (ex: perte de l'unité, différente liste de recrues).

source: Post-level 3 standard units reaching their first AMLA level-up will be able to recruit the same units as the original leader, recall, and be prefixed 'Chief' with a bronze crown icon. Excluded for special Heroes. Do not combine with 'Assimilation Mod' or 'Spoils of War'. Default:Off
fr: Les unités standards post-niveau-3 qui atteignent leur premier niveau supérieur AMLA seront en mesure de recruter et rappeler les mêmes unités que le chef d'origine, et porteront le titre de «Chef» avec l'icône de couronne en bronze. Exclus pour les héros spéciaux. Ne pas combinez pas avec 'Assimilation Mod' ou 'Spoils of War'. Par défaut:Off

source: The Leaders and Heroes (gold & silver crowns) gain an increase of 20% of their attributes and some abilities like leadership and regeneration, making them harder to kill. Excluded for Promoted Leaders. Default:Off
fr: Les Leaders et les Héros (couronnes en or ou en argent) obtiennent une augmentation de 20% de leurs attributs et quelques capacité comme commandement et régénération, ce qui les rend plus difficiles à tuer. Exclus pour les Leaders Promus. Par défaut: Off

source: 8. Learning from the battlefield (Passive XP) :
fr: 8. Apprendre du champ de bataille (XP passive) :

source: Extra XP for all units each turn. Default: 0
fr: XP supplémentaire pour chaque unité à chaque tour. Par défaut: 0

source: 9. Learning from healing (Max XP/turn for Healing) :
fr: 9. Apprendre en soignant (max XP/tour) :

source: Each turn, Healers will earn 1 XP for each adjacent wounded (but not-poisoned) ally, but you can limit the max/turn. 0 will disable the feature. Default: 1
fr: Chaque tour, les soigneurs gagneront 1 XP pour chaque allié blessé adjacent (mais non empoisonné), mais vous pouvez limiter le nombre maximum / tour. 0 désactivera la fonctionnalité. Par défaut: 1

source: 10. Berserk tweak : Fury & Bloodthirsty
fr: 10. Modification Berserk : Fureur & Soif de Sang

source: Remplace 'berserk' by a new 'Fury' weapon special, way more interesting. Come also with 'Bloodthirsty', an offensive drain.
fr: Remplace 'berserk' par une nouvelle capacité spéciale 'Fury', bien plus intéressante. Viens aussi avec 'Soif de Sang', un drain offensif.

source: 11. Ambushed tweak : Surprise Attacks
fr: 11. Modification Embuscades : Attaques Surprises

source: An ambush will trigger a quick combat in which the ambushed unit can't counter-attack. Awesome combined with NINJA WARS!. Default:Off
fr: Une embuscade déclenchera un combat rapide dans lequel l'unité prise dans une embuscade ne pourra pas contre-attaquer. Excellent combiné avec GUERRES NINJA!. Par défaut: Off

source: 12. NINJA WARS! (Stealthy units)
fr: 12. GUERRES NINJA! (unités furtives)

source: Most of units will melee back-stabs, poison arrows, distract from ZoC, be faster and invisible in villages, forests, deep water, or everywhere at night. For funny PvP with fog-of-war focused on ambushes/ hide&seek. Default:Off
fr: La plupart des unités auront des attaques de mêlée, des flèches empoisonnées, distraient les Zones de Contrôles, sont plus rapides, et invisibles dans les villages, les forêts, dans les eaux profondes ou partout la nuit. Pour des PvP amusants avec brouillard de guerre axés sur des embuscades / cache-cache. Par défaut: Off

source: Verbosity (damage/hits calculation etc)
fr: Verbosité (calcul dommages / coups, etc.)

source: If options 1 or 3 are enabled, will display messages about damage/hits number calculations. Useful for tests or understanding. Default:Off
fr: Si les options 1 ou 3 sont activées, des messages concernant le calcul du nombre de dégâts / impacts seront affichés. Utile pour les tests ou la compréhension. Par défaut: Off

source: Configurable mods to change the game mechanics, for an approach more realistic and tactic
fr: Mods configurables pour changer les mécanismes du jeu, pour une approche plus réaliste et tactique
